{
  "listings": [
    {
      "id": 1,
      "title": "Cozy Cabin in the Woods",
      "description": "Tucked away in the serene heart of nature, this cozy cabin offers a peaceful escape from the hustle and bustle of everyday life. Surrounded by the scenic beauty of Mountain View, CA, this two-bedroom, one-bathroom retreat boasts a tranquil ambiance perfect for those seeking solace in the midst of nature. With 56 glowing reviews averaging a solid 9.0, guests have praised the calming environment and the comforting seclusion it offers. Owned by Jack Johnson, this cabin is an ideal haven for nature lovers seeking a quiet, serene getaway.",
      "price": 150,
      "imageUrl": "cabin-image.jpg",
      "location": "Mountain View, CA",
      "review": 9.0,
      "number_of_reviews": 56,
      "bedrooms": 2,
      "toilets": 1,
      "owner": "Jack Johnson",
      "type": "cabin"
    },
    {
      "id": 2,
      "title": "Sunny Beachfront Condo",
      "description": "This exquisite condo in Miami, FL, presents a spectacular view of the ocean, providing a luxurious and relaxing ambiance. With three bedrooms, two bathrooms, and a price of $200, this condo, owned by Emily Roberts, invites guests to enjoy the stunning beachfront setting. With 72 reviews averaging 8.5, guests have been captivated by the picturesque ocean views and the overall beauty of this seaside sanctuary.",
      "price": 200,
      "imageUrl": "beachfront-condo.jpg",
      "location": "Miami, FL",
      "review": 8.5,
      "number_of_reviews": 72,
      "bedrooms": 3,
      "toilets": 2,
      "owner": "Emily Roberts",
      "type": "condo"
    },
    {
      "id": 3,
      "title": "Downtown Loft with City Views",
      "description": "Offering a contemporary living experience in the heart of New York, NY, this modern loft presents panoramic city skyline views that are truly breathtaking. This one-bedroom, one-bathroom apartment owned by Michael Anderson has received 48 reviews, averaging an impressive 9.3. Guests have been enamored by the fusion of modernity and urban charm, making it an ideal choice for those seeking a taste of city living. The other properties will be described below.",
      "price": 180,
      "imageUrl": "downtown-loft.jpg",
      "location": "New York, NY",
      "review": 9.3,
      "number_of_reviews": 48,
      "bedrooms": 1,
      "toilets": 1,
      "owner": "Michael Anderson",
      "type": "apartment"
    },
    {
      "id": 4,
      "title": "Rustic Mountain Retreat",
      "description": "Nestled in the tranquility of Asheville, NC, this rustic mountain retreat offers a serene escape. With two bedrooms and one bathroom, this cabin, owned by Sarah Walker, invites guests to experience the peace and beauty of the mountains. With 64 reviews averaging an 8.8 rating, visitors have praised the peaceful atmosphere and the calming influence of the natural surroundings.",
      "price": 175,
      "imageUrl": "mountain-retreat.jpg",
      "location": "Asheville, NC",
      "review": 8.8,
      "number_of_reviews": 64,
      "bedrooms": 2,
      "toilets": 1,
      "owner": "Sarah Walker",
      "type": "cabin"
    },
    {
      "id": 5,
      "title": "Seaside Cottage with Private Beach",
      "description": "Located in Cape Cod, MA, this charming cottage offers an exclusive and private beach paradise. Boasting three bedrooms and two bathrooms, this property owned by David Thompson has garnered 82 reviews with an exceptional rating of 9.5. Visitors rave about the exclusive access to the private beach and the tranquil ambiance of this seaside getaway.",
      "price": 250,
      "imageUrl": "seaside-cottage.jpg",
      "location": "Cape Cod, MA",
      "review": 9.5,
      "number_of_reviews": 82,
      "bedrooms": 3,
      "toilets": 2,
      "owner": "David Thompson",
      "type": "cottage"
    },
    {
      "id": 6,
      "title": "Historic Downtown Apartment",
      "description": "Step back in time and experience the charm of Charleston, SC, in this beautifully restored historic apartment. Owned by Olivia Williams, this one-bedroom, one-bathroom apartment has garnered 60 reviews with an average rating of 8.9. Guests appreciate the historical significance and the charm of this quaint, well-maintained property.",
      "price": 160,
      "imageUrl": "historic-apartment.jpg",
      "location": "Charleston, SC",
      "review": 8.9,
      "number_of_reviews": 60,
      "bedrooms": 1,
      "toilets": 1,
      "owner": "Olivia Williams",
      "type": "apartment"
    },
    {
      "id": 7,
      "title": "Luxury Villa with Pool",
      "description": " Indulge in luxury at this private villa in Beverly Hills, CA, boasting five bedrooms and four bathrooms, accompanied by a private pool. Owned by Matthew Davis, this opulent house has received a staggering 95 reviews with an exceptional rating of 9.8. Visitors praise the lavish amenities and the overall grandeur of this luxurious villa.",
      "price": 350,
      "imageUrl": "luxury-villa.jpg",
      "location": "Beverly Hills, CA",
      "review": 9.8,
      "number_of_reviews": 95,
      "bedrooms": 5,
      "toilets": 4,
      "owner": "Matthew Davis",
      "type": "house"
    },
    {
      "id": 8,
      "title": "Lakefront Retreat",
      "description": "Situated in the tranquil setting of Lake Tahoe, CA, this serene retreat offers breathtaking views of the lake. With two bedrooms and two bathrooms, this property owned by Sophia Clark has gathered 68 reviews with an average rating of 8.7. Guests are drawn to the peaceful ambiance and the stunning views that this lakefront property offers. The descriptions of the remaining properties will follow in the subsequent section.",
      "price": 190,
      "imageUrl": "lakefront-retreat.jpg",
      "location": "Lake Tahoe, CA",
      "review": 8.7,
      "number_of_reviews": 68,
      "bedrooms": 2,
      "toilets": 2,
      "owner": "Sophia Clark",
      "type": "house"
    },
    {
      "id": 9,
      "title": "Mountain View Bungalow",
      "description": "Embrace the awe-inspiring mountain vistas in this cozy bungalow located in Denver, CO. With two bedrooms and one bathroom, this snug retreat owned by Daniel Evans has garnered 52 reviews, maintaining an impressive rating of 9.1. Guests praise the stunning mountain views that greet them every morning, making it an ideal escape for mountain lovers.",
      "price": 140,
      "imageUrl": "mountain-bungalow.jpg",
      "location": "Denver, CO",
      "review": 9.1,
      "number_of_reviews": 52,
      "bedrooms": 2,
      "toilets": 1,
      "owner": "Daniel Evans",
      "type": "bungalow"
    },
    {
      "id": 10,
      "title": "Riverside Cabin Getaway",
      "description": " Escape to the serenity of a riverside location at this peaceful cabin in Portland, OR. With three bedrooms and one bathroom, this property owned by Ava Garcia has received 76 reviews with a respectable rating of 8.6. Visitors appreciate the tranquility and the calming influence of the nearby riverside.",
      "price": 165,
      "imageUrl": "riverside-cabin.jpg",
      "location": "Portland, OR",
      "review": 8.6,
      "number_of_reviews": 76,
      "bedrooms": 3,
      "toilets": 1,
      "owner": "Ava Garcia",
      "type": "cabin"
    },
    {
      "id": 11,
      "title": "Urban Studio in the Heart of the City",
      "description": "Immerse yourself in city living at its best in this modern urban studio located in Chicago, IL. Owned by Noah Hernandez, this one-bedroom, one-bathroom apartment has garnered 70 reviews with an average rating of 8.4. Guests are drawn to the convenience and modern appeal of this city studio.",
      "price": 120,
      "imageUrl": "urban-studio.jpg",
      "location": "Chicago, IL",
      "review": 8.4,
      "number_of_reviews": 70,
      "bedrooms": 1,
      "toilets": 1,
      "owner": "Noah Hernandez",
      "type": "apartment"
    },
    {
      "id": 12,
      "title": "Country Farmhouse with Vineyard Views",
      "description": "Experience the charm of the countryside in Napa Valley, CA, at this delightful farmhouse offering scenic vineyard views. With four bedrooms and two bathrooms, this property owned by Emma Rodriguez has gathered 44 reviews with a commendable rating of 9.2. Visitors adore the tranquil setting and the picturesque views of the surrounding vineyards.",
      "price": 210,
      "imageUrl": "country-farmhouse.jpg",
      "location": "Napa Valley, CA",
      "review": 9.2,
      "number_of_reviews": 44,
      "bedrooms": 4,
      "toilets": 2,
      "owner": "Emma Rodriguez",
      "type": "house"
    },
    {
      "id": 13,
      "title": "Beachside Bungalow with Pool",
      "description": "A beach lover's paradise awaits at this San Diego, CA bungalow, offering a private pool and easy beach access. With three bedrooms and two bathrooms, this property owned by James Baker has amassed 78 reviews with an outstanding rating of 9.6. Guests love the combination of beachside living and the luxury of a private pool.",
      "price": 280,
      "imageUrl": "beachside-bungalow.jpg",
      "location": "San Diego, CA",
      "review": 9.6,
      "number_of_reviews": 78,
      "bedrooms": 3,
      "toilets": 2,
      "owner": "James Baker",
      "type": "bungalow"
    },
    {
      "id": 14,
      "title": "Historic Mansion in the Heart of the City",
      "description": "Step into grandeur at this historic mansion located in Boston, MA, boasting modern amenities and historical significance. With six bedrooms and four bathrooms, this property owned by Isabella Martinez has received 90 reviews, maintaining a remarkable rating of 9.9. Visitors are enamored by the opulence and the historical charm of this luxurious mansion.",
      "price": 300,
      "imageUrl": "historic-mansion.jpg",
      "location": "Boston, MA",
      "review": 9.9,
      "number_of_reviews": 90,
      "bedrooms": 6,
      "toilets": 4,
      "owner": "Isabella Martinez",
      "type": "house"
    },
    {
      "id": 15,
      "title": "Desert Oasis Retreat",
      "description": "Find serenity in the desert at this tranquil oasis retreat in Scottsdale, AZ. With two bedrooms and one bathroom, this property owned by Liam Wright has gathered 62 reviews with an average rating of 8.9. Guests appreciate the peaceful ambiance and the calming influence this desert retreat offers.",
      "price": 190,
      "imageUrl": "desert-oasis.jpg",
      "location": "Scottsdale, AZ",
      "review": 8.9,
      "number_of_reviews": 62,
      "bedrooms": 2,
      "toilets": 1,
      "owner": "Liam Wright",
      "type": "house"
    },
    {
      "id": 16,
      "title": "Treehouse Hideaway in the Forest",
      "description": "Escape to the treetops in this unique and cozy treehouse hideaway located in Seattle, WA. Owned by Mia Johnson, this one-bedroom, one-bathroom cabin has garnered 80 reviews with an average rating of 8.3. Visitors are enchanted by the unique experience of staying in a treehouse and the closeness to nature it provides.",
      "price": 175,
      "imageUrl": "treehouse-hideaway.jpg",
      "location": "Seattle, WA",
      "review": 8.3,
      "number_of_reviews": 80,
      "bedrooms": 1,
      "toilets": 1,
      "owner": "Mia Johnson",
      "type": "cabin"
    },
    {
      "id": 17,
      "title": "Mountain Chalet with Hot Tub",
      "description": "Enjoy the beauty of the mountains at this cozy chalet in Aspen, CO, offering a private hot tub and scenic mountain views. With three bedrooms and two bathrooms, this property owned by Benjamin Adams has received 58 reviews with an average rating of 9.0. Guests are drawn to the stunning mountain views and the luxury of a private hot tub.",
      "price": 225,
      "imageUrl": "mountain-chalet.jpg",
      "location": "Aspen, CO",
      "review": 9.0,
      "number_of_reviews": 58,
      "bedrooms": 3,
      "toilets": 2,
      "owner": "Benjamin Adams",
      "type": "house"
    },
    {
      "id": 18,
      "title": "Countryside Cottage with Garden Views",
      "description": "Experience the beauty of the countryside at this charming cottage in Vermont, VT, offering scenic garden views. With two bedrooms and one bathroom, this property owned by Charlotte Wilson has gathered 74 reviews with an average rating of 8.8. Guests appreciate the peaceful ambiance and the picturesque views of the surrounding gardens.",
      "price": 155,
      "imageUrl": "countryside-cottage.jpg",
      "location": "Vermont, VT",
      "review": 8.8,
      "number_of_reviews": 74,
      "bedrooms": 2,
      "toilets": 1,
      "owner": "Charlotte Wilson",
      "type": "cottage"
    }
  ]
}
